[
  {
    "id": 1,
    "title": "Apartheid Museum",
    "image": "images/apartheid-museum.webp",
    "address": "Northern Parkway & Gold Reef Rd, Johannesburg",
    "description": "A museum dedicated to showcasing South Africa's apartheid history and journey toward democracy.",
    "details": "The Apartheid Museum opened in 2001 and is acknowledged as the pre-eminent museum in the world dealing with 20th century South Africa. It uses film, text, audio and live accounts to provide a chilling insight into the architecture and implementation of the apartheid system."
  },
  {
    "id": 2,
    "title": "Gold Reef City",
    "image": "images/gold-reef-city1.webp",
    "address": "Corner of Northern Parkway & Data Crescent, Ormonde, Johannesburg",
    "description": "A theme park built around an old gold mine, offering thrilling rides and historical tours.",
    "details": "Gold Reef City is built on an old gold mine that operated from 1887 to 1971. Visitors can descend into a real gold mine shaft, see gold poured, and enjoy over 30 thrilling rides and attractions including one of the tallest drop zones in the world."
  },
  {
    "id": 3,
    "title": "Cradle of Humankind",
    "image": "images/cradle-of-humankind.webp",
    "address": "Mogale City",
    "description": "Explore ancient caves and learn about human origins at this UNESCO World Heritage Site.",
    "details": "This paleoanthropological site about 50 km northwest of Johannesburg contains a complex of limestone caves where scientists have discovered more than 1,000 hominid fossils, including the famous 'Mrs Ples' and 'Little Foot' skeletons dating back millions of years."
  },
  {
    "id": 4,
    "title": "images/dinokeng game reserve.webp",
    "image": "images/dinokeng-game-reserve.webp",
    "address": "Hammanskraal, 0400",
    "description": "Excellent for wildlife enthusiasts and promoting eco-tourism.",
    "details": "Dinokeng is the only free-roaming Big 5 game reserve in Gauteng, covering over 18,500 hectares. Visitors can see lions, elephants, rhinos, leopards and buffalo in their natural habitat, along with numerous other species of wildlife and birds."
  },
  {
    "id": 5,
    "title": "Sterkfontein Caves",
    "image": "images/sterkfontien-caves.webp",
    "address": "4 Kromdraai Road, Mogale City",
    "description": "Part of the Cradle of Humankind, these caves are home to some of the world's oldest hominid fossils.",
    "details": "The Sterkfontein Caves have yielded more Australopithecus fossils than any other site in the world, including the famous 'Mrs Ples' skull. The underground tour takes visitors through spectacular cave formations while explaining the significance of the fossil finds."
  },
  {
    "id": 6,
    "title": "Montecasino",
    "image": "images/teatro-at-montecasino.webp",
    "address": "Montecasino Boulevard (Corner of William Nicol and Witkoppen), Fourways, Sandton, Johannesburg",
    "description": "A lively entertainment complex offering restaurants, theaters, and even a bird park.",
    "details": "Modelled after an Italian Tuscan village, Montecasino features a casino, two theaters, over 40 restaurants, a cinema complex, and the Montecasino Bird Gardens which houses more than 60 species of birds and other small animals in lush tropical gardens."
  },
  {
    "id": 7,
    "title": "Voortrekker Monument",
    "image": "images/voortrekker.jpeg",
    "address": "Eeufees Rd, Groenkloof 358-Jr, Pretoria, 0027",
    "description": "Highlights historical and architectural significance.",
    "details": "This massive granite structure commemorates the Voortrekkers who left the Cape Colony between 1835 and 1854. The monument features a historical frieze, museum exhibits, and offers panoramic views of Pretoria from its top level."
  },
  {
    "id": 8,
    "title": "",
    "image": "images/walter-sisulu-botanical.webp",
    "address": "Malcolm Rd, Poortview, Roodepoort, 1724",
    "description": "A tranquil spot for nature lovers, with beautiful waterfalls and rich birdlife.",
    "details": "This 300-hectare garden features indigenous plants, a spectacular waterfall, and is home to a pair of Verreaux's eagles that nest on the cliffs. The gardens offer walking trails, picnic spots, and excellent birdwatching opportunities with over 220 bird species recorded."
  }
]